src/Documents/КвитанцияМЭДО/КвитанцияМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КвитанцияМЭДО</name>
  <registerRecords>InformationRegister.СостоянияДокументовМЭДО</registerRecords>
  <attributes>
    <name>ДанныеКонверта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОшибки</name>
    <comment>Для входящих</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Для исходящей</comment>
    <type>
      <types>DefinedType.КонтрагентМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлена</name>
    <comment>Для исходящей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметКвитанцииМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеПринято</name>
    <comment>Для входящих</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/СостоянияДокументовМЭДО/СостоянияДокументовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияДокументовМЭДО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИдентификаторДокумента</name>
    <comment>Для входящего - из паспорта сообщения МЭДО, для исходящего - наш GUID из ссылки на документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСообщения</name>
    <comment>Для входящего из электронного сообщения. Для исходящего - генерируется системой</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредметСообщения</name>
    <type>
      <types>DefinedType.ПредметСообщенияМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовМЭДО</types>
    </type>
  </resources>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/НаправленияСообщенийМЭДО/НаправленияСообщенийМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияСообщенийМЭДО</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СостоянияДокументовМЭДО/СостоянияДокументовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументовМЭДО</name>
  <enumValues>
    <name>ВходящийДокументЗарегистрирован</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументЗарегистрированГотовКОтправке</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументОтправлен</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументПолучен</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ИсходящееУведомлениеЕщеНеОтправлено</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ИсходящийДокументЕщеНеОтправлен</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ОтправкаОтменена</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленаКвитанция</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленаКвитанцияОбОшибке</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленоУведомление</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ПолученаКвитанция</name>
    <comment>Для исходящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ПолученаКвитанцияОбОшибке</name>
    <comment>Для исходящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоУведомление</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>СозданаИсходящаяКвитанция</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>СозданоИсходящееУведомление</name>
    <comment>для входящих документов</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/КвитанцияМЭДО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ДанныеКонверта = Новый ХранилищеЗначения(Неопределено);
	ДанныеСообщения = Новый ХранилищеЗначения(Неопределено);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	
	Если Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
		Если Не ЗначениеЗаполнено(ИдентификаторКвитанции) Тогда
			Если ЭтоНовый() Тогда
				СсылкаНового = ИнтеграцияСМЭДО.СсылкаНовогоОбъекта(ЭтотОбъект);
				ИдентификаторКвитанции = "" + СсылкаНового.УникальныйИдентификатор();
			Иначе
				ИдентификаторКвитанции = "" + Ссылка.УникальныйИдентификатор();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// для исходящего квитанции - идентификатор входящего документа, с которым он пришел:
	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
	
		Документ = ДокументПоПредметуКвитанции(Предмет);
		НаправлениеДокумента = Перечисления.НаправленияСообщенийМЭДО.НаправлениеДокумента(Документ);
		Если НаправлениеДокумента = Перечисления.НаправленияСообщенийМЭДО.Входящее Тогда
			СтруктураСостояния = РегистрыСведений.СостоянияДокументовМЭДО.ПолучитьСостояниеДокумента(
				Документ,
				Перечисления.СостоянияДокументовМЭДО.ДокументПолучен,
				"ИдентификаторСообщения",
				Дата);
			ИдентификаторСообщения = СтруктураСостояния.ИдентификаторСообщения;
		ИначеЕсли НаправлениеДокумента = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда 
			СтруктураСостояния = РегистрыСведений.СостоянияДокументовМЭДО.ПолучитьСостояниеДокумента(
				Документ,
				Перечисления.СостоянияДокументовМЭДО.ДокументОтправлен,
				"ИдентификаторСообщения",
				Дата);
			ИдентификаторСообщения = СтруктураСостояния.ИдентификаторСообщения;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СостоянияДокументовМЭДО.Записывать = Истина;
	
	Движение = Движения.СостоянияДокументовМЭДО.Добавить();
	Движение.Период = Дата;
	Движение.ПредметСообщения = Ссылка;
	Движение.Документ = ДокументПоПредметуКвитанции(Предмет);
	// Направление в регистре определяется по документу:
	Движение.Направление = Перечисления.НаправленияСообщенийМЭДО.НаправлениеДокумента(Движение.Документ);
	Движение.ИдентификаторСообщения = ИдентификаторСообщения;
	
	Если Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
		
		// исходящая квитанция на входящий документ/входящее уведомление:
		Если Отправлена Тогда
			Если ЗначениеЗаполнено(КодОшибки) Или ЗначениеЗаполнено(КомментарийОшибки) Тогда
				Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ОтправленаКвитанцияОбОшибке;
			Иначе
				Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ОтправленаКвитанция;
			КонецЕсли;
		Иначе
			Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.СозданаИсходящаяКвитанция;
		КонецЕсли;
		
	ИначеЕсли Направление = Перечисления.НаправленияСообщенийМЭДО.Входящее Тогда
		
		Движение.ИдентификаторДокумента = "";// не играет роли. 
		
		// Входящая квитанция на исходящий документ/исходящее уведомление:
		Если СообщениеПринято Тогда
			Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ПолученаКвитанция;
		Иначе
			Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ПолученаКвитанцияОбОшибке;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументПоПредметуКвитанции(Предмет)

	Если ТипЗнч(Предмет) = Тип("ДокументСсылка.УведомлениеМЭДО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Предмет, "Документ");
	Иначе
		Возврат Предмет;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
